# -----------------------------------------------------------------------------
# 다양한 함수의 형태 - (1) 기본
# -----------------------------------------------------------------------------
# 함수 기능 : 팩토리얼을 계산 후 계산 결과를 반환해주는 기능
#             팩토리얼이란? 3! = 3 * 2 * 1
# 함수 이름 : funcFac
# 매개 변수 : num
# 반환값    : 계산 결과
# -----------------------------------------------------------------------------
# 2! = 2 * 1
# 3! = 3 * 2 * 1
# 4! = 4 * 3 *2 * 1
# 5! = 5 * 4 * 3 * 2 * 1
# 10! = 10 * 9 * 8 * 7 * 6 * 5 * 4 * 3 * 2 * 1
# 0! = 1
def funcFac(num: int):
    # return 1 if num <= 1 else num * funcFac(num-1)
    ret = 1
    if num > 0:
        for n in range(num, 0, -1):
            ret *= n
    return ret


print(funcFac(3))
print(funcFac(4))
print(funcFac(5))


# -----------------------------------------------------------------------------
# 함수 기능 : 팩토리얼을 계산 후 계산 결과를 아래와 같은 형태로 반환해주는 기능
#             팩토리얼이란? 3! = 3 * 2 * 1
# 함수 이름 : funcFac2
# 매개 변수 : num
# 반환값    : 계산 str
# -----------------------------------------------------------------------------
def funcFac2(num: int):
    strRet = f'{num}! = '
    ret = 1
    if num > 0:
        for n in range(num, 0, -1):
            ret *= n
            strRet += f'{n} * ' if n != 1 else ' = '
    return f'{strRet}{ret}'


print(funcFac2(3))
print(funcFac2(4))
print(funcFac2(5))
print(funcFac2(0))
