# -------------------------------------------------------------------------------------------------
# 함수와 클래스
# -------------------------------------------------------------------------------------------------
# 변수에 어떤 데이터를 저장하고 있는지 확인 함수 => type(변수명)
data = 1

print(f'data Type => {type(data)}')


# 사용자 정의 함수 생성 ---------------------------------------------------------------------------
# 함수 기능 : 2개 정수 더한 후 결과 출력 기능
# 함수 이름 : addTwo
# 매개 변수 :
# -------------------------------------------------------------------------------------------------

def addTwo(n1, n2):
    print(n1 + n2)


# 함수의 타입 출력 ===> type() 내장함수 사용
print(type(addTwo))

# -------------------------------------------------------------------------------------------------
# [활용 예]
# - 1~10 범위에서 임의의 정수 5개를 저장
# - 중복된 정수 저장 가능
# -------------------------------------------------------------------------------------------------
from random import randint
nums = []
for i in range(5):
    nums.append(randint(1, 10))
print(nums)

func = [max, min, sorted, sum, len]
for f in func:
    if f == sorted:
        print(f(nums, reverse=True))
    else:
        print(f(nums))

funcDict = {'최대값': max, '최소값': min, '정  렬': sorted, '합  계': sum, '갯  수': len}
for key, f in funcDict.items():
    if f == sorted:
        print(f'{key} : {f(nums, reverse=True)}')
    else:
        print(f'{key} : {f(nums)}')
